// Задача 6 определение четности числа
Console.Clear();
Console.WriteLine("Введите число: ");
int NumberA = Convert.ToInt32(Console.ReadLine());

if (NumberA % 2 ==0)
{
     Console.WriteLine("да");
}
else
{
    Console.WriteLine("нет");
}

